server/sql/testdata/soapxml/getSendingOptions_v2.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xtee="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:dhl="http://producers.dhl.xtee.riik.ee/producer/dhl">
   <soapenv:Header>
      <xtee:toimik xsi:type="xsd:string"/>
      <xtee:nimi xsi:type="xsd:string">dhl.getSendingOptions.v2</xtee:nimi>
      <xtee:id xsi:type="xsd:string">dhl_client_1</xtee:id>
      <xtee:ametnik xsi:type="xsd:string">38806190294</xtee:ametnik>
      <xtee:andmekogu xsi:type="xsd:string">dhl</xtee:andmekogu>
      <xtee:asutus xsi:type="xsd:string">70006317</xtee:asutus>
      <xtee:isikukood>EE38806190294</xtee:isikukood>
   </soapenv:Header>
   <soapenv:Body>
      <dhl:getSendingOptions soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <keha xsi:type="dhl:institutionRefsArrayType">
			<asutus>70006317</asutus>
			<asutus>adit</asutus>
			<asutus>10839212</asutus>	
			<vahetatud_dokumente_vahemalt>0</vahetatud_dokumente_vahemalt>
			<vahetatud_dokumente_kuni>1000</vahetatud_dokumente_kuni>
			<vastuvotmata_dokumente_ootel>true</vastuvotmata_dokumente_ootel>
         </keha>
      </dhl:getSendingOptions>
   </soapenv:Body>
</soapenv:Envelope>

